tornado_ab_test_result.txt
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.1.50 (be patient).....done


Server Software:        TornadoServer/4.4.1
Server Hostname:        192.168.1.50
Server Port:            8124

Document Path:          /
Document Length:        12 bytes

Concurrency Level:      100
Time taken for tests:   0.241 seconds
Complete requests:      100
Failed requests:        0
Write errors:           0
Total transferred:      20700 bytes
HTML transferred:       1200 bytes
Requests per second:    414.85 [#/sec] (mean)
Time per request:       241.053 [ms] (mean)
Time per request:       2.411 [ms] (mean, across all concurrent requests)
Transfer rate:          83.86 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    5   1.0      5       6
Processing:     7   98  59.1     96     232
Waiting:        2   98  59.2     96     232
Total:          9  103  58.8    100     238

Percentage of the requests served within a certain time (ms)
  50%    100
  66%    128
  75%    144
  80%    153
  90%    171
  95%    233
  98%    237
  99%    238
 100%    238 (longest request)